openfoam/test_cases/CB2_ref_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
    "/home/openfoam/boundary_conditions/ptInletVelocity/libPtInletVelocity.so"
    "/home/openfoam/boundary_conditions/ptBoundaryDisplacement/libPtBoundaryDisplacement.so"
    "/home/openfoam/boundary_conditions/ptSurfaceVelocity/libPtSurfaceVelocity.so"
);

application     scalarPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          5e-4;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.0;

maxDeltaT       5.0e-4;

// ************************************************************************* //
