openfoam/test_cases/CB2_ref_0/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bubble
    {
        type            ptBoundaryDisplacement;
        center          (0 0 0);
        direction       (0 1 0);
        normal          (0 0 1);
        modelName       "rad_CB2.ts";
        radius          0.5;
        value           uniform (0 0 0);
    }
   "(inlet|outlet|side)"
   {
        type            fixedValue;
        value           uniform (0 0 0);
   }
   "wedge_.*"
   {
        type            wedge;
   }
}


// ************************************************************************* //
